; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; Warehouse
;
; By: Ryan Xiao Wang, 2024
; License: MIT
;
; The aim is to move remove exactly the boxes that are marked for removal.
; Boxes start on stacks of blocks that are located on a fixed number of bases,
; and can be moved between stacks and bases. Boxes can be removed from the
; stacks and bases they are on when they are the top box.
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain warehouse)
    (:requirements :strips :typing :equality)
    (:types box base) 
    (:predicates 
        (on ?b1 - box ?b2 - box)
        (on-base ?b - box ?base - base)
        (clear ?b - box)
        (clear-base ?b - base)
        (to-remove ?b - box)
        (removed ?b - box)
    )

    (:action move
        :parameters (?b ?old-under ?new-under - box)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-to-new-base
        :parameters (?b ?old-under - box ?new-base - base)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear-base ?new-base)
        )
        :effect (and 
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-from-base
        :parameters (?b - box ?base - base ?new-under - box)
        :precondition (and
            (clear ?b)
            (on-base ?b ?base)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear-base ?base)
            (not (on-base ?b ?base))
        )
    )

    (:action move-between-base
        :parameters (?b - box ?old-base ?new-base - base)
        :precondition (and
            (clear ?b)
            (on-base ?b ?old-base)
            (clear-base ?new-base)
        )
        :effect (and
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear-base ?old-base)
            (not (on-base ?b ?old-base))
        )
    )

    (:action remove
        :parameters (?b ?under - box)
        :precondition (and
            (to-remove ?b)
            (on ?b ?under)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear ?under)
            (not (on ?b ?under))
            (not (clear ?b))
        )
    )

    (:action remove-from-base
        :parameters (?b - box ?base - base)
        :precondition (and
            (to-remove ?b)
            (on-base ?b ?base)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear-base ?base)
            (not (on-base ?b ?base))
            (not (clear ?b))
        )
    )
)

; problem
;; boxes=37, remove_proportion=0.101, bases=14, instance_id=10, output=./training, seed=51

(define (problem warehouse-10)
    (:domain warehouse)
    (:objects
        box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 box11 box12 box13 box14 box15 box16 box17 box18 box19 box20 box21 box22 box23 box24 box25 box26 box27 box28 box29 box30 box31 box32 box33 box34 box35 box36 box37 - box
        base1 base2 base3 base4 base5 base6 base7 base8 base9 base10 base11 base12 base13 base14 - base
    )
    (:init
        (to-remove box16)
        (to-remove box33)
        (to-remove box36)
        (clear box25)
        (on box25 box31)
        (on box31 box28)
        (on-base box28 base1)
        (clear box27)
        (on-base box27 base2)
        (clear box1)
        (on box1 box35)
        (on-base box35 base3)
        (clear box4)
        (on box4 box2)
        (on-base box2 base4)
        (clear box30)
        (on box30 box22)
        (on box22 box7)
        (on-base box7 base5)
        (clear box36)
        (on box36 box20)
        (on box20 box17)
        (on-base box17 base6)
        (clear box21)
        (on box21 box23)
        (on box23 box9)
        (on-base box9 base7)
        (clear box32)
        (on box32 box11)
        (on-base box11 base8)
        (clear box14)
        (on box14 box10)
        (on box10 box15)
        (on box15 box6)
        (on box6 box29)
        (on-base box29 base9)
        (clear box37)
        (on box37 box18)
        (on-base box18 base10)
        (clear box16)
        (on box16 box19)
        (on box19 box33)
        (on-base box33 base11)
        (clear box24)
        (on box24 box12)
        (on box12 box13)
        (on-base box13 base12)
        (clear-base base13)
        (clear box34)
        (on box34 box26)
        (on box26 box5)
        (on box5 box3)
        (on box3 box8)
        (on-base box8 base14)
    )
    (:goal (and 
        (removed box16)
        (removed box33)
        (removed box36)
    ))
)

; plan
1. (remove box16 box19)
   deleted: (on box16 box19) (clear box16)
   added: (removed box16) (clear box19)
   goals met: 1 of 3
2. (move box19 box33 box1)
   deleted: (clear box1) (on box19 box33)
   added: (on box19 box1) (clear box33)
   goals met: 1 of 3
3. (remove-from-base box33 base11)
   deleted: (on-base box33 base11) (clear box33)
   added: (removed box33) (clear-base base11)
   goals met: 2 of 3
4. (remove box36 box20)
   deleted: (on box36 box20) (clear box36)
   added: (removed box36) (clear box20)
   goals met: 3 of 3
